; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-3nodes-1000size-5degree-100mindistance-8trucks-2packages-1217seed

(define (problem transport-three-cities-sequential-3nodes-1000size-5degree-100mindistance-8trucks-2packages-1217seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  truck-5 - vehicle
  truck-6 - vehicle
  truck-7 - vehicle
  truck-8 - vehicle
  package-1 - package
  package-2 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 534,862 -> 983,903
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 46)
  ; 983,903 -> 534,862
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 46)
  ; 534,862 -> 51,890
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 49)
  ; 51,890 -> 534,862
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 49)
  ; 2200,992 -> 2169,693
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 31)
  ; 2169,693 -> 2200,992
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 31)
  ; 2448,538 -> 2169,693
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 32)
  ; 2169,693 -> 2448,538
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 32)
  ; 2448,538 -> 2200,992
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 52)
  ; 2200,992 -> 2448,538
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 52)
  ; 1350,2142 -> 1508,2162
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 16)
  ; 1508,2162 -> 1350,2142
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 16)
  ; 1851,2878 -> 1508,2162
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 80)
  ; 1508,2162 -> 1851,2878
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 80)
  ; 983,903 <-> 2169,693
  (road city-1-loc-1 city-2-loc-1)
  (= (road-length city-1-loc-1 city-2-loc-1) 121)
  (road city-2-loc-1 city-1-loc-1)
  (= (road-length city-2-loc-1 city-1-loc-1) 121)
  (road city-1-loc-1 city-3-loc-1)
  (= (road-length city-1-loc-1 city-3-loc-1) 121)
  (road city-3-loc-1 city-1-loc-1)
  (= (road-length city-3-loc-1 city-1-loc-1) 121)
  (road city-2-loc-1 city-3-loc-1)
  (= (road-length city-2-loc-1 city-3-loc-1) 121)
  (road city-3-loc-1 city-2-loc-1)
  (= (road-length city-3-loc-1 city-2-loc-1) 121)
  (at package-1 city-3-loc-2)
  (at package-2 city-3-loc-3)
  (at truck-1 city-1-loc-1)
  (capacity truck-1 capacity-4)
  (at truck-2 city-2-loc-2)
  (capacity truck-2 capacity-2)
  (at truck-3 city-1-loc-3)
  (capacity truck-3 capacity-4)
  (at truck-4 city-2-loc-3)
  (capacity truck-4 capacity-4)
  (at truck-5 city-2-loc-1)
  (capacity truck-5 capacity-3)
  (at truck-6 city-2-loc-1)
  (capacity truck-6 capacity-4)
  (at truck-7 city-3-loc-1)
  (capacity truck-7 capacity-3)
  (at truck-8 city-2-loc-2)
  (capacity truck-8 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-1)
  (at package-2 city-1-loc-2)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-7 city-3-loc-1 city-3-loc-3)
   deleted: (at truck-7 city-3-loc-1)
   added: (at truck-7 city-3-loc-3)
   goals met: 0 of 2
2. (pick-up truck-7 city-3-loc-3 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-3-loc-3) (capacity truck-7 capacity-3)
   added: (in package-2 truck-7) (capacity truck-7 capacity-2)
   goals met: 0 of 2
3. (drive truck-7 city-3-loc-3 city-3-loc-1)
   deleted: (at truck-7 city-3-loc-3)
   added: (at truck-7 city-3-loc-1)
   goals met: 0 of 2
4. (drive truck-7 city-3-loc-1 city-3-loc-2)
   deleted: (at truck-7 city-3-loc-1)
   added: (at truck-7 city-3-loc-2)
   goals met: 0 of 2
5. (pick-up truck-7 city-3-loc-2 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-3-loc-2) (capacity truck-7 capacity-2)
   added: (in package-1 truck-7) (capacity truck-7 capacity-1)
   goals met: 0 of 2
6. (drive truck-7 city-3-loc-2 city-3-loc-1)
   deleted: (at truck-7 city-3-loc-2)
   added: (at truck-7 city-3-loc-1)
   goals met: 0 of 2
7. (drive truck-7 city-3-loc-1 city-2-loc-1)
   deleted: (at truck-7 city-3-loc-1)
   added: (at truck-7 city-2-loc-1)
   goals met: 0 of 2
8. (drop truck-7 city-2-loc-1 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-7) (capacity truck-7 capacity-1)
   added: (at package-1 city-2-loc-1) (capacity truck-7 capacity-2)
   goals met: 1 of 2
9. (drive truck-7 city-2-loc-1 city-1-loc-1)
   deleted: (at truck-7 city-2-loc-1)
   added: (at truck-7 city-1-loc-1)
   goals met: 1 of 2
10. (drive truck-7 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-7 city-1-loc-1)
   added: (at truck-7 city-1-loc-3)
   goals met: 1 of 2
11. (drive truck-7 city-1-loc-3 city-1-loc-2)
   deleted: (at truck-7 city-1-loc-3)
   added: (at truck-7 city-1-loc-2)
   goals met: 1 of 2
12. (drop truck-7 city-1-loc-2 package-2 capacity-2 capacity-3)
   deleted: (in package-2 truck-7) (capacity truck-7 capacity-2)
   added: (at package-2 city-1-loc-2) (capacity truck-7 capacity-3)
   goals met: 2 of 2
